In [2]:
#This is dataframe cheetsheet
import pandas as pd
import numpy as np

df = pd.read_csv('/Users/abhijitkumar/projects/design/analytics/employees1.csv')
print(df.head())
print(df.describe())

df1 = df['Name']
print(df1.head())

   EmployeeID        Name  Age Department  Salary  \
0        1001  Employee_1   50      Sales   92711
1        1002  Employee_2   36         HR   71323
2        1003  Employee_3   29      Sales   48752
3        1004  Employee_4   42      Sales  112205
4        1005  Employee_5   40    Finance   43395

                     JoiningDate
0  1970-01-01 00:00:00.000018616
1  1970-01-01 00:00:00.000019664
2  1970-01-01 00:00:00.000018478
3  1970-01-01 00:00:00.000018810
4  1970-01-01 00:00:00.000014811
        EmployeeID          Age         Salary
count  1000.000000  1000.000000    1000.000000
mean   1500.500000    40.947000   73821.873000
std     288.819436    11.160858   25809.264454
min    1001.000000    22.000000   30155.000000
25%    1250.750000    31.000000   51577.500000
50%    1500.500000    42.000000   73942.000000
75%    1750.250000    50.000000   95433.500000
max    2000.000000    59.000000  119906.000000
0    Employee_1
1    Employee_2
2    Employee_3
3    Employee_4
4    Employee_5
Name: Name, dtype: object

In [4]:
df.sort_values('Salary', ascending=False)

,EmployeeID,Name,Age,Department,Salary,JoiningDate
884,1885,Employee_885,50,Marketing,119906,1970-01-01 00:00:00.000019066
166,1167,Employee_167,22,HR,119881,1970-01-01 00:00:00.000015750
368,1369,Employee_369,58,IT,119822,1970-01-01 00:00:00.000015734
144,1145,Employee_145,29,Sales,119818,1970-01-01 00:00:00.000015913
839,1840,Employee_840,35,Finance,119709,1970-01-01 00:00:00.000016147
...,...,...,...,...,...,...
653,1654,Employee_654,39,IT,30282,1970-01-01 00:00:00.000017245
897,1898,Employee_898,23,Sales,30193,1970-01-01 00:00:00.000018264
158,1159,Employee_159,38,HR,30163,1970-01-01 00:00:00.000015917
496,1497,Employee_497,28,Marketing,30162,1970-01-01 00:00:00.000016162
746,1747,Employee_747,38,IT,30155,1970-01-01 00:00:00.000019148

In [8]:
thirdlargest = df['Salary'].nlargest(3).iloc[-1]
thirdlargest

np.int64(119822)

In [9]:
df['new_salary'] = df['Salary'] * 1.1
print(df.head())

   EmployeeID        Name  Age Department  Salary  \
0        1001  Employee_1   50      Sales   92711
1        1002  Employee_2   36         HR   71323
2        1003  Employee_3   29      Sales   48752
3        1004  Employee_4   42      Sales  112205
4        1005  Employee_5   40    Finance   43395

                     JoiningDate  new_salary
0  1970-01-01 00:00:00.000018616    101982.1
1  1970-01-01 00:00:00.000019664     78455.3
2  1970-01-01 00:00:00.000018478     53627.2
3  1970-01-01 00:00:00.000018810    123425.5
4  1970-01-01 00:00:00.000014811     47734.5

In [11]:
df.columns

Index(['EmployeeID', 'Name', 'Age', 'Department', 'Salary', 'JoiningDate',
       'new_salary'],
      dtype='object')